{
  "intents": [
    {
      "tag": "greeting",
      "keywords": ["hi", "hello", "hey", "howdy", "greetings"],
      "responses": ["Hello! Welcome to our Travel Kiosk.", "Hi there! How can I assist you?", "Hey! How can I help you today?"]
    },
    {
      "tag": "fare_inquiry",
      "keywords": ["fares", "prices", "cost", "tickets", "rates", "price"],
      "responses": ["Sure, I can help you with fare inquiries. Please specify your destination and travel dates.", "To assist you with fares, could you please provide your destination and travel dates?"]
    },
    {
      "tag": "destination_info",
      "keywords": ["destinations", "places", "attractions", "cities"],
      "responses": ["We offer a variety of destinations including beaches, mountains, and vibrant cities. Where are you planning to travel?", "Our destinations range from serene beaches to bustling cities. What kind of place are you interested in?"]
    },
    {
      "tag": "services",
      "keywords": ["services", "facilities", "amenities", "offers"],
      "responses": ["We provide services like guided tours, airport transfers, and hotel bookings. How can I assist you with our services?", "Our services include guided tours, airport transfers, and exclusive hotel deals. What do you need help with?"]
    },
    {
      "tag": "booking",
      "keywords": ["book", "reserve", "confirm", "booking", "reservation"],
      "responses": ["Certainly! To proceed with booking, please provide your full name, contact number, and preferred travel dates.", "Great! To book your trip, I'll need your full name, contact number, and travel dates."]
    },
    {
      "tag": "about penang",
      "keywords": ["history", "about", "penang", "where"],
      "responses": ["Penang is a state located on the northwest coast of Peninsular Malaysia, by the Strait of Malacca. It consists of Penang Island and Seberang Perai on the mainland. The state is known for its rich cultural heritage, historical sites, and vibrant food scene. The capital city of Penang is George Town, which is located on the northeastern tip of Penang Island."]
    },
    {
      "tag": "famous food",
      "keywords": ["food", "delicacies", "yummy", "tasty", "Michelin"],
      "responses": ["Penang's culinary scene is incomplete without mentioning the iconic Penang Road Famous Cendol. This refreshing dessert, featuring shaved ice, coconut milk, red beans, and the signature green rice flour jelly, is a must-try. Its unique blend of flavors and textures makes it a delightful treat for locals and tourists alike. For detailed transport information, visit our kiosk and select the Food button for a comprehensive guide."]
    },
    {
      "tag": "shopping",
      "keywords": ["shopping mall"],
      "responses": ["For the best shopping experience, explore Gurney Plaza, Queensbay Mall, and Komtar Mall. Each offers a unique selection of shops and entertainment. For more information, visit our kiosk and select the 'Mall' button."]
    },
    {
      "tag": "market",
      "keywords": ["market"],
      "responses": ["Visit the famous Batu Ferringhi Night Market for a lively atmosphere and a variety of local crafts and souvenirs. Don't miss the hustle and bustle of Jelutong Market for a taste of local life. For more information, check our kiosk and select the 'Market' button."]
    },
    {
      "tag": "attractions",
      "keywords": ["attractions"],
      "responses": ["Discover Penang's rich history at Fort Cornwallis, explore the cultural heritage of Clan Jetties, and marvel at the beauty of Kek Lok Si Temple. For more details on these attractions, visit our kiosk and select the 'Explore Destination' button."]
    },
    {
      "tag": "transport",
      "keywords": ["transport", "car", "bus", "drive", "rapid", "ferry"],
      "responses": ["Tourists in Penang have various transportation options. You can explore the island and mainland using public buses, drive around with rental cars, or experience the scenic views via the iconic Penang Ferry. For detailed transport information, visit our kiosk and select the transport button for a comprehensive guide."]
    },
    {
      "tag": "tickets",
      "keywords": ["tickets", "buy tickets"],
      "responses": ["Tickets for various attractions can be conveniently purchased at our kiosk. Simply visit our kiosk and select the 'Ticket' option to make your arrangements hassle-free."]
    },
    {
      "tag": "map",
      "keywords": ["map", "location"],
      "responses": ["Explore Penang with ease using our detailed map available at the kiosk. It provides information on key locations, attractions, and essential points of interest. Visit our kiosk and select the 'Map' option for a comprehensive guide to navigate the beauty of Penang."]
    },
    {
      "tag": "quiz",
      "keywords": ["quiz", "game"],
      "responses": ["Challenge yourself with our exciting Penang quiz game! Test your knowledge about the rich history, culture, and attractions of Penang. Head to our kiosk and select the 'Quiz Game' option to embark on a fun and educational journey."]
    },
    {
      "tag": "goodbye",
      "keywords": ["bye", "goodbye", "see you", "take care"],
      "responses": ["Goodbye! Have a safe and enjoyable journey.", "See you next time! Take care and safe travels!"]
    },
    {
      "tag": "thanks",
      "keywords": ["thanks", "thank you", "appreciate"],
      "responses": ["You're welcome! If you have any more questions, feel free to ask.", "It was my pleasure to assist you. If you need further help, don't hesitate to reach out."]
    },
    {
      "tag": "fallback",
      "keywords": ["*"],
      "responses": ["I'm sorry, I didn't understand that. Please feel free to ask another question."]
    }
  ]
}
